tap "homebrew-ffmpeg/ffmpeg"
tap "powershell/tap"
tap "teamookla/speedtest"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Automatic configure script builder
brew "autoconf"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# Use Codex from ACP-compatible clients such as Zed!
brew "codex-acp"
# Common UNIX Printing System
brew "cups"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Handle input method in command-line
brew "fcitx-remote-for-osx"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of time utility
brew "gnu-time"
# Improved top (interactive process viewer)
brew "htop"
# Website copier/offline browser
brew "httrack"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for reading and writing quicktime files
brew "libquicktime"
# Mac App Store command-line interface
brew "mas"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Utility for managing network connections
brew "netcat"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Port scanning utility for large networks
brew "nmap"
# Collection of macOS command-line utilities
brew "osxutils"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Cryptographically sign and verify files
brew "signify-osx"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Use SOCKS-friendly applications with Tor
brew "torsocks"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Show the current WiFi network password
brew "wifi-password"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Command-line interface for WordPress
brew "wp-cli"
# XML command-line utilities
brew "xmlstarlet"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac", "with-libplacebo", "with-libsoxr", "with-openh264", "with-openjpeg", "with-openssl", "with-rubberband", "with-srt", "with-webp", "with-zimg"]
# Formula to install PowerShell
brew "powershell/tap/powershell"
# Formula to install PowerShell Long Term Stable Channel
brew "powershell/tap/powershell-lts"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
# Menu bar usage monitor for Codex and Claude
cask "codexbar"
cask "font-adwaita-mono-nerd-font"
cask "font-andale-mono"
cask "font-anka-coder"
cask "font-annotation-mono"
cask "font-ark-pixel-10px-monospaced"
cask "font-ark-pixel-12px-monospaced"
cask "font-ark-pixel-16px-monospaced"
cask "font-atkinson-hyperlegible-mono"
cask "font-atkynson-mono-nerd-font"
cask "font-aurulent-sans-mono-nerd-font"
cask "font-average-mono"
cask "font-awesome-terminal-fonts"
cask "font-azeret-mono"
cask "font-b612-mono"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-brass-mono"
cask "font-camingocode"
cask "font-cascadia-code"
cask "font-cascadia-code-nf"
cask "font-cascadia-code-pl"
cask "font-cascadia-mono"
cask "font-cascadia-mono-nf"
cask "font-cascadia-mono-pl"
cask "font-caskaydia-mono-nerd-font"
cask "font-chivo-mono"
cask "font-code-new-roman-nerd-font"
cask "font-code2002"
cask "font-comic-mono"
cask "font-comic-shanns-mono-nerd-font"
cask "font-commit-mono"
cask "font-commit-mono-nerd-font"
cask "font-courier-prime-code"
cask "font-cutive-mono"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-delugia-mono-complete"
cask "font-delugia-mono-powerline"
cask "font-departure-mono"
cask "font-departure-mono-nerd-font"
cask "font-dm-mono"
cask "font-droid-sans-mono-for-powerline"
cask "font-droid-sans-mono-nerd-font"
cask "font-encode-sans"
cask "font-encode-sans-condensed"
cask "font-encode-sans-expanded"
cask "font-encode-sans-sc"
cask "font-encode-sans-semi-condensed"
cask "font-encode-sans-semi-expanded"
cask "font-envy-code-r"
cask "font-envy-code-r-nerd-font"
cask "font-everson-mono"
cask "font-fantasque-sans-mono"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-google-sans-code"
# Speech recognition tool
cask "macwhisper"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# SEO site audit tool
cask "screaming-frog-seo-spider"
# Rust-based terminal
cask "warp"
# Database management tool with AI-powered features
cask "whodb"
mas "Metadatics", id: 554883654
mas "Microsoft Outlook", id: 985367838
mas "Microsoft To Do", id: 1274495053
mas "Pages", id: 409201541
mas "SiteSucker", id: 442168834
mas "Telegram", id: 747648890
mas "WhatsApp", id: 310633997
